dependently-typed-printf/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title></title>
<meta name="author" content="(Nabil Hassein)"/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/reveal.js/3.0.0/css/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/reveal.js/3.0.0/css/theme/night.css" id="theme"/>

<link rel="stylesheet" href="./presentation.css"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h2 class="author">Nabil Hassein</h2><p class="date">Created: 2017-05-11 Thu 15:40</p>
</section>
<section id="table-of-contents">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#/slide-org2b3770e">1. printf</a></li>
<li><a href="#/slide-orgdc9641f">2. Static Types, simple and dependent</a></li>
<li><a href="#/slide-org1ec5aea">3. printf revisited</a></li>
</ul>
</div>
</div>
</section>
<section>
<section id="slide-org2b3770e">
<h2 id="org2b3770e"><span class="section-number-2">1</span> printf</h2>
<div class="outline-text-2" id="text-1">
</div></section>
</section>
<section>
<section id="slide-orgbc129dd">
<h3 id="orgbc129dd"><span class="section-number-3">1.1</span> In a few languages, right and wrong</h3>
<div class="outline-text-3" id="text-1-1">
</div></section>
</section>
<section>
<section id="slide-orgc15b603">
<h4 id="orgc15b603"><span class="section-number-4">1.1.1</span> C</h4>
<p>
for implementation details I need to man 3 va_arg apparently
</p>
<div class="org-src-container">

<pre  class="src src-C">#include &lt;stdio.h&gt;
int main() {
    printf("hello, %s\n", "world");
    printf("1 + 1 = %d\n", 2);
    printf("hello, %d\n", "world");
}
</pre>
</div>
<ul>
<li>gcc example.c</li>
<li>./a.out</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgf7f1baf">
<h4 id="orgf7f1baf"><span class="section-number-4">1.1.2</span> Python</h4>
<p>
Implemented in C in standard Python; in Python in pypy
</p>
<div class="org-src-container">

<pre  class="src src-python">print "hello, %s\n" % "world"
print "1 + 1 = %d\n" % 2
print "hello, %d\n" % "world"
</pre>
</div>

<ul>
<li>python example.py</li>

</ul>

</section>
</section>
<section>
<section id="slide-org6ab363a">
<h4 id="org6ab363a"><span class="section-number-4">1.1.3</span> Haskell</h4>
<p>
done with weird typeclass hackery
</p>
<div class="org-src-container">

<pre  class="src src-haskell">import Text.Printf
main = do
  printf "hello, %s\n" world
  printf "1 + 1 = %d\n" 2
  printf "hello, %d\n" "world"
</pre>
</div>

<ul>
<li>cd haskell</li>
<li>docker build -t nabilhassein/haskell-printf .</li>
<li>docker run -it nabilhassein/haskell-printf</li>
<li>why does this compile??? :(</li>
<li>why can't I `:t printf "hello, %s"`?</li>
<li>there must be a nicer way. types are always the answer.</li>

</ul>

</section>
</section>
<section>
<section id="slide-orgdc9641f">
<h2 id="orgdc9641f"><span class="section-number-2">2</span> Static Types, simple and dependent</h2>
<div class="outline-text-2" id="text-2">
</div></section>
</section>
<section>
<section id="slide-org7de3df5">
<h3 id="org7de3df5"><span class="section-number-3">2.1</span> Natural Numbers</h3>
<div class="org-src-container">

<pre  class="src src-idris">data Nat = Z | S Nat
plus : Nat -&gt; Nat -&gt; Nat
plus Z n = n
plus (S k) n = S (plus k n)
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgf0dd088">
<h3 id="orgf0dd088"><span class="section-number-3">2.2</span> First Class Types</h3>
<div class="org-src-container">

<pre  class="src src-idris">foo : Bool -&gt; Type
foo True = Int
foo False = String

bar : (b: Bool) -&gt; foo b
bar True = 1
bar False = "hi"
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org5e16bb0">
<h3 id="org5e16bb0"><span class="section-number-3">2.3</span> Vectors</h3>
<div class="org-src-container">

<pre  class="src src-idris">data Vect : Nat -&gt; Type -&gt; Type where
  Nil : Vect 0 a
  (::) : a -&gt; Vect n a -&gt; Vect (S n) a

append : Vect n a -&gt; Vect m a -&gt; Vect (n + m) a
append []        ys = ys
append (x :: xs) ys = x :: append xs ys
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orge129a1b">
<h3 id="orge129a1b"><span class="section-number-3">2.4</span> Typechecking</h3>
<div class="org-src-container">

<pre  class="src src-idris">v : Vect 3 String
v = ["hello", "world"]

-- fails with this type error:
-- main.idr:7:6:When checking right hand side of v with expected type
--         Vect 3 String

-- When checking an application of constructor Main.:::
--         Type mismatch between
--                 Vect 0 a (Type of [])
--         and
--                 Vect 1 String (Expected type)

--         Specifically:
--                 Type mismatch between
--                         0
--                 and
--                         1
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org07ea958">
<h3 id="org07ea958"><span class="section-number-3">2.5</span> But wait, there's more!</h3>
<p>
bounded numbers with safe indexing
</p>
<div class="org-src-container">

<pre  class="src src-idris">index : Fin n -&gt; Vect n a -&gt; a
index FZ     (x :: xs) = x
index (FS k) (x :: xs) = index k xs
</pre>
</div>

<p>
matrices with static typechecking of legal multiplication
</p>
<div class="org-src-container">

<pre  class="src src-idris">mul_matrix : Matrix n m -&gt; Matrix m p -&gt; Matrix n p
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org1ec5aea">
<h2 id="org1ec5aea"><span class="section-number-2">3</span> printf revisited</h2>
<div class="outline-text-2" id="text-3">
</div></section>
</section>
<section>
<section id="slide-org9b512a5">
<h3 id="org9b512a5"><span class="section-number-3">3.1</span> printf.idr</h3>
<ul>
<li>show Dockerfile</li>
<li>show printf source</li>
<li>docker build -t nabilhassein/idris-printf .</li>
<li>docker run -it nabilhassein/idris-printf</li>
<li>:t printf "hello, %s"</li>
<li>:t printf "1 + 1 = %d"</li>

</ul>
</section>
</section>
<section>
<section id="slide-orge15ee5d">
<h3 id="orge15ee5d"><span class="section-number-3">3.2</span> Does -XTypeInType make this better in Haskell now?</h3>
</section>
</section>
<section>
<section id="slide-orgde00c72">
<h3 id="orgde00c72"><span class="section-number-3">3.3</span> Further reading</h3>
<p>
<a href="https://nabilhassein.github.io/blog/notes-on-idris/">https://nabilhassein.github.io/blog/notes-on-idris/</a>
</p>
</section>
</section>
</div>
</div>
<script src="https://cdn.jsdelivr.net/reveal.js/3.0.0/lib/js/head.min.js"></script>
<script src="https://cdn.jsdelivr.net/reveal.js/3.0.0/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: true,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
overview: true,
width: 1200,
height: 800,
margin: 0.10,
minScale: 0.50,
maxScale: 2.50,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'none', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'https://cdn.jsdelivr.net/reveal.js/3.0.0/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: 'https://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'https://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
